{
  "NAVBAR": {
    "ABOUT": "Über mich",
    "SKILLS": "Skills",
    "PROJECTS": "Projekte"
  },
  "LANDINGPAGE": {
    "CHECK": "Meine Projekte",
    "CONTACT": "Kontakt",
    "FRONTEND": "Frontend Entwickler"
  },
  "MARQUEE": {
    "ITEMS": [
      "Verfügbar für Remote-Arbeit",
      "Frontend-Entwickler",
      "Mit Sitz in Köln",
      "Offen für neue Projekte"
    ]
  },
  "ABOUT_ME": {
    "WHO": "Wer ich bin",
    "TITLE": "Über mich",
    "SUBTITLE": "Hallo, ich bin Željko! Ich begeistere mich für Programmieren, lerne gerne neue Technologien und verbessere ständig meine Fähigkeiten.",
    "LOCATION": "Ich lebe in Köln. Ich bin offen für Remote-, Hybrid- und Büroarbeit und flexibel, mich an unterschiedliche Arbeitsumgebungen anzupassen.",
    "HEAD": "Ich bin aufgeschlossen und stets begeistert davon, neue Technologien zu erlernen und meine Fähigkeiten kontinuierlich zu verbessern.",
    "CHECK": "Mein Ansatz zur Problemlösung basiert auf analytischem Denken, Kreativität und Ausdauer. Ich lerne aus jeder Herausforderung und strebe stets danach, Lösungen zu finden, die sowohl effizient als auch elegant sind. Ich glaube an Zusammenarbeit und sehe jedes Hindernis als Chance, mich weiterzuentwickeln und meine Fähigkeiten zu erweitern."
  },
  "TECHNOLOGIES": {
    "TECH": "Technologien",
    "TITLE": "Kompetenzen",
    "CONTENT": "Ich bin ein engagierter Entwickler mit Fokus auf die Entwicklung moderner, responsiver Webanwendungen. Als motivierter Quereinsteiger habe ich mir schnell eine solide Grundlage in komponentenbasierter Architektur und starker Typisierung innerhalb des Angular-Ökosystems aufgebaut. Ich liefere sauberen, wartbaren Code und nutze dabei REST-API-Integrationen sowie praktische Erfahrung mit Firebase. Das hohe Entwicklungstempo der Webentwicklung begeistert mich; kontinuierliches Lernen und Anpassungsfähigkeit haben für mich höchste Priorität, sodass ich mich schnell zu einem wertvollen Mitglied jedes Teams entwickle.",
    "QUESTION_WHITE": "Benötigen Sie noch eine",
    "QUESTION_GREEN": "weitere Kompetenz?",
    "INVITE": "Kontaktieren Sie mich gerne. Ich freue mich darauf, mein bisheriges Wissen weiter auszubauen.",
    "CONTACT": "Kontakt aufnehmen"
  },
  "PROJECTS": {
    "TITLE": "Projekte im Fokus",
    "SUBTITLE": "Entdecken Sie hier einen Abschnitt meiner Arbeiten - interagieren Sie  \n mit den Projekten, um meine Fähigkeiten in Aktion zu sehen.",
    "ITEMS": [
      {
        "ID": "01",
        "NAME": "Join",
        "ABOUT": "Worum geht es bei diesem Projekt?",
        "DESCRIPTION": "Taskmanager inspiriert vom Kanban-System. Erstelle und organisiere Aufgaben mit Drag-and-Drop-Funktionen, weise Benutzer und Kategorien zu.",
        "TECH": [
          {
            "NAME": "HTML",
            "IMG": "assets/images/tech_overlay/html_overlay.png"
          },
          {
            "NAME": "CSS",
            "IMG": "assets/images/tech_overlay/css_overlay.png"
          },
          {
            "NAME": "JavaScript",
            "IMG": "assets/images/tech_overlay/js_overlay.png"
          },
          {
            "NAME": "Firebase",
            "IMG": "assets/images/tech_overlay/firebase_overlay.png"
          }
        ],
        "GITHUB": "https://github.com/Alakovic/join_v2",
        "DEMO": "https://zeljko-alakovic.developerakademie.net/join_v2/",
        "IMG": "assets/images/projects/join.png",
        "NEXT": "Nächstes Projekt"
      },
      {
        "ID": "02",
        "NAME": "Sharky",
        "ABOUT": "Worum geht es bei diesem Projekt?",
        "DESCRIPTION": "Spiel basierend auf objektorientiertem Ansatz. Hilf Sharky, durch verschiedene Gegner zu kommen, alle Münzen und giftigen Trank zu finden, um gegen den großen verrückten Hai zu kämpfen.",
        "TECH": [
          {
            "NAME": "HTML",
            "IMG": "assets/images/tech_overlay/html_overlay.png"
          },
          {
            "NAME": "CSS",
            "IMG": "assets/images/tech_overlay/css_overlay.png"
          },
          {
            "NAME": "JavaScript",
            "IMG": "assets/images/tech_overlay/js_overlay.png"
          }
        ],
        "GITHUB": "https://github.com/Alakovic/Sharky---THE-GAME",
        "DEMO": "https://zeljko-alakovic.developerakademie.net/Sharky---THE-GAME/",
        "IMG": "assets/images/projects/sharky.png",
        "NEXT": "Nächstes Projekt"
      }
    ]
  },
  "CONTACT": {
    "HEAD": "Kontaktieren Sie mich ",
    "TITLE": "Lassen Sie uns  zusammenarbeiten",
    "QUESTION": "Haben Sie ein Problem zu lösen?",
    "CONTENT": "Ich freue mich darauf, Ihre Ideen zum Leben zu erwecken! Ob es sich um ein Projekt, eine Herausforderung oder eine Position handelt, die Sie im Sinn haben – ich freue mich, von Ihnen zu hören. Lassen Sie uns gemeinsam etwas Großartiges schaffen.",
    "QUESTION_WHITE": "Brauchen Sie einen Frontend-Entwickler?",
    "QUESTION_GREEN": "Kontakt aufnehmen!"
  },
  "CONTACT_FORM": {
    "NAME": "Wie ist dein Name?",
    "NAME_PLACEHODER": "Hier kommt dein Name hin",
    "NAME_ERROR": "Hoppla! Dein Name fehlt noch",
    "EMAIL": "Wie lautet deine E-Mail Adresse?",
    "EMAIL_PLACEHOLDER": "deineemail@email.com",
    "EMAIL_ERROR": "Hoppla! Deine E-Mail-Adresse ist erforderlich",
    "TEXT": "Wie kann ich dir helfen?",
    "TEXT_PLACEHOLDER": "Hallo Zeljko, ich interessiere mich für...",
    "TEXT_ERROR": "Was möchtest du entwickeln?",
    "PRIVACY": "Ich habe die ",
    "PRIVACY_GREEN": "Datenschutzerklärung",
    "PRIVACY_WHITE": " gelesen und stimme der Verarbeitung meiner Daten wie beschrieben zu.",
    "ACCEPT": "Bitte akzeptieren Sie die Datenschutzerklärung",
    "BUTTON": "Sag Hallo ;)"
  },
   "FOOTER" : {
    "DEVELOPER" : "Web Entwickler",
    "CITY" : "Köln Deutschland",
    "IMPRESSUM" : "Impressum"
  },
  "REFERENCES" : {
    "HEADLINE" : "Das sagen meine Kollegen über mich",
    "REFERENCE" : [
      {
        "NAME" : "Kyrylo Novikov",
        "TEXT" : "Ich hatte das Vergnügen, mit Željko am Projekt „Join“ zu arbeiten, und die Zusammenarbeit war durchweg reibungslos und professionell. Sein Engagement, seine Präzision und seine Teamfähigkeit haben maßgeblich zur Qualität des Endprodukts beigetragen.",
        "ROLE" : "Join Team Member"
      },
      {
        "NAME": "André Zelmer",
        "TEXT": "Ich habe mit Željko an mehreren Projekten gearbeitet. Im Projekt „Join“ übernahm er den Bereich der Aufgabenverwaltung und lieferte zuverlässig ab. Technisch sehr kompetent und menschlich absolut unkompliziert – genau das, was man sich in einem Team wünscht.",
        "ROLE": "Join Team Member"
      },
      {
        "NAME": "Stefan Krischan",
        "TEXT":"Ich habe mit Željko am Projekt „Join“ zusammengearbeitet. Seine technische Kompetenz und seine ausgeprägte Teamorientierung haben kontinuierlich zum Erfolg unserer Arbeit beigetragen.",
        "ROLE": "Join Team Member"
      }
    ]
  },
  "IMPRINT" : {
    "HEADLINE" : "Impressum",
    "PORTFOLIO" : "Portfolio(Produkt)",
    "IMPRINT" : "Impressum ",
    "BOARD" : "Erkundung des Boards",
    "TERMS_HEAD" : "Einwilligung in die Bedingungen",
    "TERMS_CONTENT1": "Durch den Zugriff auf und die Nutzung von",
    "TERMS_CONTENT2": "erkennen Sie die folgenden Geschäftsbedingungen sowie alle dazugehörigen Richtlinien, Leitlinien oder Änderungen an, die Ihnen von Zeit zu Zeit vorgelegt werden können. Ich, Željko Alakovic, behalte mir das Recht vor, diese Geschäftsbedingungen jederzeit und ohne vorherige Ankündigung zu aktualisieren oder zu ändern.",
    "SCOPE_HEAD" : "Umfang und Eigentumsrechte am Produkt",
    "SCOPE_CONTENT1" : "wurde im Rahmen eines Projekts in einem Webentwicklungs-Bootcamp bei der",
    "SCOPE_CONTENT2" : "entwickelt. Es dient ausschließlich zu Bildungszwecken und ist nicht für eine umfangreiche private oder geschäftliche Nutzung vorgesehen. Daher können wir keine Garantie für eine dauerhafte Verfügbarkeit, Zuverlässigkeit, Genauigkeit oder andere Qualitätsmerkmale dieses Produkts übernehmen.",
    "SCOPE_CONTENT3" : "Das Design von",
    "SCOPE_CONTENT4" : "ist Eigentum der",
    "SCOPE_CONTENT5" : "Die unbefugte Nutzung, Vervielfältigung, Veränderung, Verbreitung oder Nachahmung des Designs ist strengstens untersagt." ,
    "RIGHTS_HEAD" : "Eigentumsrechte",
    "RIGHTS_CONTENT1" : "Abgesehen vom Design, das Eigentum der",
    "RIGHTS_CONTENT2" : "ist, behalte ich, Željko Alakovic, sämtliche Eigentumsrechte an" ,
    "RIGHTS_CONTENT3" : ", einschließlich aller zugehörigen urheberrechtlich geschützten Materialien, Marken sowie sonstiger geschützter Informationen." ,
    "PRODUCT_HEAD" : "Nutzung des Produkts",
    "PRODUCT_CONTENT1" : "darf ausschließlich zu rechtmäßigen Zwecken und in Übereinstimmung mit allen geltenden Gesetzen und Vorschriften genutzt werden. Jegliche Nutzung von",
    "PRODUCT_CONTENT2" : " für illegale Aktivitäten oder zur Belästigung, Schädigung, Bedrohung oder Einschüchterung anderer Personen ist strengstens untersagt. Sie sind allein verantwortlich für Ihre Interaktionen mit anderen Nutzern von",
    "DISCLAIMER_HEAD" : "Haftungsausschluss und Haftungsbeschränkung",
    "DISCLAIMER_CONTENT1" : "wird im vorliegenden Zustand 'as is' und ohne jegliche Gewährleistung bereitgestellt, weder ausdrücklich noch stillschweigend, einschließlich, aber nicht beschränkt auf stillschweigende Gewährleistungen der Marktgängigkeit, der Eignung für einen bestimmten Zweck sowie der Nichtverletzung von Rechten Dritter. In keinem Fall haften ich, Željko Alakovic, oder die",
    "DISCLAIMER_CONTENT2" : "für direkte, indirekte, zufällige, besondere, Folge- oder exemplarische Schäden, einschließlich, aber nicht beschränkt auf Schäden durch entgangenen Gewinn, Verlust von Goodwill, Nutzungsausfall, Datenverlust oder sonstige immaterielle Verluste, selbst wenn wir auf die Möglichkeit solcher Schäden hingewiesen wurden, die aus der Nutzung oder der Leistungsfähigkeit von" ,
    "DISCLAIMER_CONTENT3" : "entstehen oder damit in Zusammenhang stehen.",
    "INDEMNITY_HEAD" : "Freistellung" ,
    "INDEMNITY_CONTENT1" : "Sie erklären sich damit einverstanden, mich, Željko Alakovic, die",
    "INDEMNITY_CONTENT2" : "sowie unsere verbundenen Unternehmen, Partner, leitenden Angestellten, Direktoren, Vertreter und Mitarbeiter von sämtlichen Ansprüchen, Forderungen, Verlusten, Schäden, Kosten oder Haftungen (einschließlich angemessener Rechtsanwaltskosten) freizustellen, zu verteidigen und schadlos zu halten, die aus oder im Zusammenhang mit Ihrer Nutzung von" ,
    "INDEMNITY_CONTENT3" : " und/oder Ihrem Verstoß gegen diesen rechtlichen Hinweis entstehen.",
    "CONTACT" : "Bei Fragen oder Mitteilungen kontaktieren Sie mich bitte unter",
    "DATE" :  "Datum:  Dezember 15, 2025"
  }
}
